{
  "title" : "Captain Slovakistan",
  "description" : "Hack your way through an insecure website of the army of Slovakistan to promote a certain person to captain",
  "prerequisities" : [ ],
  "outcomes" : [ "Keeping sensitive information in code comments is a really bad idea", "SQL injection on login form", "Basic usage of web shell", "Basic work with SQL database" ],
  "state" : "UNRELEASED",
  "show_stepper_bar" : true,
  "levels" : [ {
    "type" : "InfoLevelImportDTO",
    "title" : "Introduction",
    "max_score" : 0,
    "level_type" : "INFO_LEVEL",
    "order" : 0,
    "estimated_duration" : 0,
    "content" : "You live in a mysterious country of Slovakistan, where opportunities are endless and everything is possible. For many years you have been working in IT security and the experience you have gained makes you an expert. Lately, you have become more and more interested in shady business. The money and excitement it brings are incomparable to your old office job.  Luckily for you, in Slovakistan there is plenty of such stuff. Sometimes, your trusted boss Marián \"Brucho\" K. gives you pretty surreal job offers. The last one from today is one of them.  There is a member of the parliament called Andrej Danko with a rather bizarre wish. He holds a rank of Corporal in the local armed forces. For a reason which is incomprehensible for everyone involved, he longs for a rank of Captain.  If you can hack into the army database and make Andrej's wish come true, surely \"Brucho\" would reward you generously."
  }, {
    "type" : "GameLevelImportDTO",
    "title" : "Find the insecure internal web page of the army",
    "max_score" : 100,
    "level_type" : "GAME_LEVEL",
    "order" : 1,
    "estimated_duration" : 1,
    "flag" : "Sherlock",
    "content" : "In Slovakistan the money for state-funded projects, like highways or the new but unfinished official website of the army **www.armada-slovakistan.sk**, rarely reaches its destination. Instead it usually ends up in private pockets. Therefore developers do not have enough resources to build them securely. Try to use this to find out whether you could access some **internal** web page of the army.\n\n\nThe flag is visible on the internal web page.",
    "solution" : "Connect to the terminal on Attacker, open a web browser and go to www.armada-slovakistan.sk\n\nOpen a source code of the web page. There is a comment with a link to the internal website www.armada-slovakistan.sk/internal.php\n\nFLAG: Flag *Sherlock* is visible on the internal web page.\n",
    "solution_penalized" : true,
    "hints" : [ {
      "title" : "Where to  look",
      "content" : "Look at the web page from a developer's point of view.",
      "hint_penalty" : 30,
      "order" : 2
    }, {
      "title" : "Look around",
      "content" : "There is a useful information hidden somewhere.",
      "hint_penalty" : 15,
      "order" : 0
    }, {
      "title" : "Explore",
      "content" : "Explore the web page carefully.",
      "hint_penalty" : 15,
      "order" : 1
    } ],
    "incorrect_flag_limit" : 100,
    "MITRE_techniques" : {
      "TA0043.T1594": "Reconnaissance.Search Victim-Owned Websites"
    }
  }, {
    "type" : "GameLevelImportDTO",
    "title" : "Find your way through login page",
    "max_score" : 100,
    "level_type" : "GAME_LEVEL",
    "order" : 2,
    "estimated_duration" : 10,
    "flag" : "NAKA_is_watching_you",
    "content" : "So now you know that they left the internal page unprotected. Surely such amateurs could not secure it properly. Who knows what lies behind the login.",
    "solution" : "To get through the login form, you need to perform an SQL injection.\n\nUse **`' or '1'='1`** in password field to bypass the login.\n\nThen you get redirected to a file managing page where you should see a file named *FLAG* which contains the flag: *NAKA_is_watching_you*",
    "solution_penalized" : true,
    "hints" : [ {
      "title" : "Where to start",
      "content" : "The database uses SQL. It is possible to misuse the potential weakness in the authentication process by injecting malicious input.",
      "hint_penalty" : 15,
      "order" : 1
    }, {
      "title" : "Login form",
      "content" : "The login form communicates with a database which stores usernames and passwords in one of its tables. However, you **do not need to know, find out or extract** the credentials to bypass the login. The web page will not reveal you anything.",
      "hint_penalty" : 10,
      "order" : 0
    }, {
      "title" : "Input form field",
      "content" : "The input from input fields is placed directly to an SQL query as a string. In case of **unexpected input** in **password field** the authentication function could bypass the login process. (Both fields have to contain something)",
      "hint_penalty" : 35,
      "order" : 2
    } ],
    "incorrect_flag_limit" : 100,
    "MITRE_techniques" : {
      "TA0001.T1190" : "Initial Access.Exploit Public-Facing Application"
    }
  }, {
    "type" : "GameLevelImportDTO",
    "title" : "Take control of the web server",
    "max_score" : 100,
    "level_type" : "GAME_LEVEL",
    "order" : 3,
    "estimated_duration" : 4,
    "flag" : "CrazyRussianHacker",
    "content" : "Well done! You have accessed the internal site.\n\nIt seems like it is some sort of file sharing platform of the web server the site is running on. If you can misuse this platform, you should be able to seize control of the web server and maybe even its **database**.\n\nTake a look at a **web shell** script, which is already prepared on your computer in Documents folder. Don't forget that you secured your backdoor with password to keep the access just for yourself. Use the web shell to get control of the web server. It is upon you to find out how ...\n\nThe flag is inside a file named **FLAG** (which is different from the FLAG file of the previous level). Once you set up the web shell, search the server for this file. ",
    "solution" : "First click on the *Upload File* button in the upper right corner of the filemanager.\n\nThen upload the web shell file located in a folder in Documents folder.\n\nFinally, access the web shell through link: www.armada-slovakistan/data/webshell.php (depends on the folder where you place the file)\n\nThe flag is inside a file named /FLAG",
    "solution_penalized" : true,
    "hints" : [ {
      "title" : "Access rights",
      "content" : "You can write into a directory only if you have sufficient privileges (access rights) to that directory.",
      "hint_penalty" : 15,
      "order" : 1
    }, {
      "title" : "Web shell",
      "content" : "Your web shell is a regular php file. You could make a great use of it if you manage to place it on a web server.",
      "hint_penalty" : 15,
      "order" : 0
    }, {
      "title" : "FLAG location",
      "content" : "FLAG file is located at the top of the UNIX file system hierarchy in '**/**' folder.",
      "hint_penalty" : 10,
      "order" : 2
    } ],
    "incorrect_flag_limit" : 100,
    "MITRE_techniques" : {
      "TA0003.T1505.003" : "Persistence.Server Software Component.Web Shell",
      "TA0009.T1005" : "Collection.Data from Local System"
    }
  }, {
    "type" : "GameLevelImportDTO",
    "title" : "Find your way into the army database",
    "max_score" : 100,
    "level_type" : "GAME_LEVEL",
    "order" : 4,
    "estimated_duration" : 7,
    "flag" : "KimPutin",
    "content" : "Great! Now you can view the files of the server which runs the web page and stores its content. You are close, but not done yet.\n\nFind out how to access the database which stores the information about military personnel. You will need to have the right **credentials** to access such an important database. Once you control it, you can change any information about anyone!\n\nFlag is in the database table with military personnel.\n\nBind the name and surname of the person with rank **Supreme Leader** (e.g. for *\\<Surname\\>* *\\<Name\\>* the flag would be *\\<NameSurname\\>*)",
    "solution" : "Credentials in plain text are stored in file */passwd_secret_db*\n\nPress the [SQL] button and use those credentials to connect to the database.\n\nusername: armada\n\npassword: armada-password\n\ndatabase: armada\n\nThen click on *ranks* on the left side of the web shell, to see the table *ranks*.\n\nThe person with rank Supreme Leader is Kim Putin, therefore after you bind the name with the surname you get the flag - *KimPutin*",
    "solution_penalized" : true,
    "hints" : [ {
      "title" : "Credentials location",
      "content" : "Before you can access the database, you have to search the filesystem for a file with useful information like credentials.\n\nTry looking at a location which **you have already visited in previous level**",
      "hint_penalty" : 15,
      "order" : 1
    }, {
      "title" : "Database interaction",
      "content" : "Use the **[SQL]** button in web shell to interact with local databases using simple SQL queries.",
      "hint_penalty" : 15,
      "order" : 0
    } ],
    "incorrect_flag_limit" : 100,
    "MITRE_techniques" : {
      "TA0006.T1552.001" : "Credential Access.Unsecured Credentials.Credentials In Files",
      "TA0001.T1078.003" : "Initial Access.Valid Accounts.Local Accounts",
      "TA0009.T1005" : "Collection.Data from Local System"
    }
  }, {
    "type" : "GameLevelImportDTO",
    "title" : "Promote Andrej",
    "max_score" : 100,
    "level_type" : "GAME_LEVEL",
    "order" : 5,
    "estimated_duration" : 2,
    "flag" : "RandomWordGenerator",
    "content" : "Awesome! Now you're in and you have a full control of the database. Do whatever you want! Just remember to fulfill Andrej's dream of becoming a captain.\n\nAfter you promote ***Andrej Danko*** to ***Captain***, the final flag will appear in Andrej's row in the *ranks* table and your task will be successfuly completed.",
    "solution" : "We want to UPDATE the *army rank* of Andrej Danko. To do that, we can write an SQL query such as:\n`UPDATE ranks SET army_rank = 'Captain' WHERE surname = 'Danko';`\n\nVoila! Andrej Danko is now a Captain. You should see the flag *RandomWordGenerator* in the same field that you have just edited.",
    "solution_penalized" : true,
    "hints" : [ {
      "title" : "SQL command",
      "content" : "To update an SQL row, you will find UPDATE statement useful. You can specify what column and row you are updating with WHERE clausule.",
      "hint_penalty" : 25,
      "order" : 1
    }, {
      "title" : "Interaction with database",
      "content" : "You can communicate with local databases using SQL queries.",
      "hint_penalty" : 15,
      "order" : 0
    } ],
    "incorrect_flag_limit" : 100,
    "MITRE_techniques" : {
      "TA0040.T1565.001" : "Impact.Data Manipulation.Stored Data Manipulation"
    }
  } ],
  "estimated_duration" : 24,
  "sandbox_definition_ref_id" : 15
}